// Задача 49: Задайте двумерный массив. Найдите элементы, у
// которых оба индекса нечётные, и замените эти элементы на их
// квадраты.
// Например, изначально массив выглядел вот так:
// 1 47 2
// 5 92 3
// 8 42 4
// Новый массив будет выглядеть вот так:
// 1 47 2
// 5 81 9
// 8 42 4
Console.WriteLine("Hello, World!");
